In [1]:
%%capture
!pip install pandas

In [2]:
import pandas as pd

In [3]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [5]:
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [6]:
df.head(2)

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [9]:
df[["Name", "Age"]]

      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22

In [10]:
df1 = df[["Name", "Age"]]
df1

      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22

In [13]:
df.iloc[2]

Name    Charlie
Age          22
City    Chicago
Name: 2, dtype: object

In [14]:
df.iloc[:2]

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [15]:
df.loc[1]

Name            Bob
Age              27
City    Los Angeles
Name: 1, dtype: object

In [16]:
# Select rows where Age > 23
print(df[df['Age'] > 23])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [17]:
df['Age']> 23

0     True
1     True
2    False
Name: Age, dtype: bool

In [24]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 52000, 60000, 62000, 58000]
}
df = pd.DataFrame(data)

In [25]:
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
Finance    58000.0
HR         51000.0
IT         61000.0
Name: Salary, dtype: float64

In [21]:
### Create a DataFrame and Filter Employees with Salary>60000

In [28]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['IT', 'HR', 'IT', 'Finance'],
    'Salary': [50000, 52000, 62000, 58000]
}
df = pd.DataFrame(data)
df[df['Salary']>60000]

      Name Department  Salary
2  Charlie         IT   62000

In [31]:
df.to_csv('data.csv')

In [35]:
pd.read_csv("data.csv")

   Unnamed: 0     Name Department  Salary
0           0    Alice         IT   50000
1           1      Bob         HR   52000
2           2  Charlie         IT   62000
3           3    David    Finance   58000

In [36]:
### How to drop index or re-order index while reading file using pandas
### Hint drop index function